In [1]:
import pandas as pd

## Pandas Data Structures
Pandas has two main data structures for storing data:

1. Series
2. DataFrame

In [4]:
# Series - A series is a one-dimensional object and can store data of any type.
sample_series = pd.Series([1,2,3,4,5])
print(sample_series)

0    1
1    2
2    3
3    4
4    5
dtype: int64

A dataframe is a two dimensional array and typically can be seen as a table having rows and columns. A pandas dataframe can be created using various inputs such as dictionaries, numpy ndarrays, lists, series and even another dataframe.

In [6]:
empty_df = pd.DataFrame()
print(empty_df)

Empty DataFrame
Columns: []
Index: []

In [7]:
#Creating a DataFrame from a list of dictionaries
dic = [{'a':1,'b':2},{'a':3,'b':4,'c':7}]
dict_df = pd.DataFrame(dic)
print(dict_df)

   a  b    c
0  1  2  NaN
1  3  4  7.0

In [8]:
# Creating a DataFrame from ndarrays
ndarrays_df = {'Employee Name':['Jim', 'Jill', 'Alan', 'Scott'],'Emp No':[2556,3476,3934,5223]}
ndarrays_df = pd.DataFrame(ndarrays_df)
print(ndarrays_df)

  Employee Name  Emp No
0           Jim    2556
1          Jill    3476
2          Alan    3934
3         Scott    5223

In [109]:
# Creating dataframe using csv file
df = pd.read_csv('student_mat.csv',sep=';')

In [110]:
# making the database smaller for our usecase
df.columns
df = df[['school','sex','age','health','address','studytime','internet']]
df = df.sample(100)
df.reset_index(drop=True, inplace=True)
df.head()

  school sex  age  health address  studytime internet
0     GP   M   18       5       U          2      yes
1     GP   M   18       1       U          1      yes
2     GP   F   17       1       U          2      yes
3     GP   F   17       5       U          3      yes
4     GP   F   17       4       U          3      yes

# Data Exploration and Information

In [43]:
df.head() # prints the initial rows

  school sex  age  health address  studytime internet
0     GP   M   19       4       U          1      yes
1     GP   F   16       5       U          1       no
2     GP   F   16       5       U          1      yes
3     GP   M   16       5       U          1       no
4     GP   F   19       3       U          2      yes

In [44]:
df.tail() # prints end of the rows

   school sex  age  health address  studytime internet
95     GP   F   18       3       U          3      yes
96     GP   M   17       5       U          1      yes
97     GP   F   16       4       U          3      yes
98     MS   M   18       5       R          1      yes
99     MS   F   17       3       R          2       no

In [45]:
df.info() #gives lots of info about the dataframe

<class 'pandas.core.frame.DataFrame'>
RangeIndex: 100 entries, 0 to 99
Data columns (total 7 columns):
 #   Column     Non-Null Count  Dtype
---  ------     --------------  -----
 0   school     100 non-null    object
 1   sex        100 non-null    object
 2   age        100 non-null    int64
 3   health     100 non-null    int64
 4   address    100 non-null    object
 5   studytime  100 non-null    int64
 6   internet   100 non-null    object
dtypes: int64(3), object(4)
memory usage: 5.6+ KB

In [46]:
df.describe() # gives the information about each column like mean, median , standard deviation

              age     health   studytime
count  100.000000  100.00000  100.000000
mean    16.660000    3.45000    2.080000
std      1.207887    1.47966    0.837022
min     15.000000    1.00000    1.000000
25%     16.000000    2.00000    2.000000
50%     17.000000    3.50000    2.000000
75%     18.000000    5.00000    2.000000
max     20.000000    5.00000    4.000000

In [47]:
df.shape #Get the dimensions (rows, columns) of the DataFrame.

(100, 7)

In [48]:
# to check data types of columns
df.dtypes

school       object
sex          object
age           int64
health        int64
address      object
studytime     int64
internet     object
dtype: object

In [49]:
# to get all column names:
df.columns

Index(['school', 'sex', 'age', 'health', 'address', 'studytime', 'internet'], dtype='object')

In [50]:
#nunique() and unique()
#df['column_name'].nunique(): Returns the number of unique values in a specific column.
#df['column_name'].unique(): Returns an array of unique values in a specific column.

df['age'].unique(),df['age'].nunique()

(array([19, 16, 15, 17, 18, 20], dtype=int64), 6)

In [120]:
df.nunique()

school        2
sex           2
age           7
health        5
study_time    4
internet      2
dtype: int64

In [51]:
#value_counts(): Counts the frequency of each unique value in a specific column.
df['age'].value_counts()

age
16    30
17    24
18    21
15    19
19     5
20     1
Name: count, dtype: int64

In [52]:
#dropna parameter determines if NaN should not be included in count. It it true by default :i.e nan values are not added in count
df['age'].value_counts(dropna=False)

age
16    30
17    24
18    21
15    19
19     5
20     1
Name: count, dtype: int64

In [53]:
#isnull() :Returns a DataFrame of the same shape with True for missing values and False for non-missing values.
df.isnull()

    school    sex    age  health  address  studytime  internet
0    False  False  False   False    False      False     False
1    False  False  False   False    False      False     False
2    False  False  False   False    False      False     False
3    False  False  False   False    False      False     False
4    False  False  False   False    False      False     False
..     ...    ...    ...     ...      ...        ...       ...
95   False  False  False   False    False      False     False
96   False  False  False   False    False      False     False
97   False  False  False   False    False      False     False
98   False  False  False   False    False      False     False
99   False  False  False   False    False      False     False

[100 rows x 7 columns]

In [54]:
# to find the number of null values in columns
df.isnull().sum()

school       0
sex          0
age          0
health       0
address      0
studytime    0
internet     0
dtype: int64

In [55]:
# tells if there are null values in column
df.isnull().all()

school       False
sex          False
age          False
health       False
address      False
studytime    False
internet     False
dtype: bool

# Statistical functions

In [56]:
#corr(): Calculates the pairwise correlation of numerical columns in the DataFrame.
# first need to convert the other data_types to number
numeric_df = df.select_dtypes(include='number')
numeric_df.corr()

                age    health  studytime
age        1.000000 -0.060473  -0.062742
health    -0.060473  1.000000  -0.102763
studytime -0.062742 -0.102763   1.000000

In [57]:
# .cov(): Calculates the covariance matrix of numerical columns.
numeric_df.cov()

                age    health  studytime
age        1.458990 -0.108081  -0.063434
health    -0.108081  2.189394  -0.127273
studytime -0.063434 -0.127273   0.700606

In [59]:
df['age'].mean()

16.66

In [60]:
df['age'].median()

17.0

In [61]:
df['age'].mode()

0    16
Name: age, dtype: int64

In [62]:
df['age'].min()

15

In [63]:
df['age'].max()

20

In [64]:
df['age'].std()

1.2078865422670697

In [65]:
df['age'].describe()

count    100.000000
mean      16.660000
std        1.207887
min       15.000000
25%       16.000000
50%       17.000000
75%       18.000000
max       20.000000
Name: age, dtype: float64

# Indexing and Selection and Editing

In [66]:
# Select a single column by name.
df['school']

0     GP
1     GP
2     GP
3     GP
4     GP
      ..
95    GP
96    GP
97    GP
98    MS
99    MS
Name: school, Length: 100, dtype: object

In [67]:
# Select multiple columns by name.
df[['age','studytime']]

    age  studytime
0    19          1
1    16          1
2    16          1
3    16          1
4    19          2
..  ...        ...
95   18          3
96   17          1
97   16          3
98   18          1
99   17          2

[100 rows x 2 columns]

In [68]:
#can be used for taking subset of a df too
df2 = df[['age','studytime']]
df2.head(3)

   age  studytime
0   19          1
1   16          1
2   16          1

In [69]:
df.iloc[1] # data present at location 1

school       GP
sex           F
age          16
health        5
address       U
studytime     1
internet     no
Name: 1, dtype: object

In [70]:
df.iloc[1,2] # df.iloc[row, column]: Select data by integer-based location.

16

In [71]:
df.iloc[:,2] # Second column that is the Age column and all rows

0     19
1     16
2     16
3     16
4     19
      ..
95    18
96    17
97    16
98    18
99    17
Name: age, Length: 100, dtype: int64

In [72]:
df.loc[5,['age','school','sex']] # selecting some columns for one row using loc

age       16
school    GP
sex        F
Name: 5, dtype: object

In [73]:
# df.loc[row_label, column_label]: Select data by label-based location.
df.loc[5]

school        GP
sex            F
age           16
health         3
address        U
studytime      2
internet     yes
Name: 5, dtype: object

In [74]:
# defining index to a dataframe
survey = pd.DataFrame({'James': ['I liked it', 'It could use a bit more salt'], 'Emily': ['It is too sweet', 'Yum!']},
                     index = ['Product A', 'Product B'])

survey

                                  James            Emily
Product A                    I liked it  It is too sweet
Product B  It could use a bit more salt             Yum!

In [75]:
#resetting index and placing it as a row
survey.reset_index(drop = False, inplace = True)
survey

       index                         James            Emily
0  Product A                    I liked it  It is too sweet
1  Product B  It could use a bit more salt             Yum!

In [116]:
df.columns

Index(['school', 'sex', 'age', 'health', 'studytime', 'internet'], dtype='object')

In [117]:
# rename columns 
df = df.rename(columns={'studytime':'study_time'})
df.columns

Index(['school', 'sex', 'age', 'health', 'study_time', 'internet'], dtype='object')

In [88]:
#conditional select
df[df['age']==17].head(2)

   school sex  age  health address  studytime internet
16     GP   M   17       2       U          2      yes
24     GP   F   17       3       U          2      yes

In [89]:
# multiple condition --age 17 and sec Male
df[(df['age']==17) & (df['sex']=='M')].head(2)

   school sex  age  health address  studytime internet
16     GP   M   17       2       U          2      yes
36     GP   M   17       5       U          1      yes

In [90]:
# multiple condition --age 17 OR sec Male
df[(df['age']==17) | (df['sex']=='M')].head(2)

  school sex  age  health address  studytime internet
0     GP   M   19       4       U          1      yes
3     GP   M   16       5       U          1       no

In [91]:
# to get data from a column which has lots of null
df[df['age'].isnull()]

Empty DataFrame
Columns: [school, sex, age, health, address, studytime, internet]
Index: []

In [92]:
# to get data that is in a particular set
df[df['age'].isin([16,17,18])].head()

  school sex  age  health address  studytime internet
1     GP   F   16       5       U          1       no
2     GP   F   16       5       U          1      yes
3     GP   M   16       5       U          1       no
5     GP   F   16       3       U          2      yes
6     GP   M   16       5       U          2      yes

# Data Cleaning and Transformation:

1. df.drop(labels, axis): Remove rows or columns.
2. df.fillna(value): Fill missing values with a specified value.
3. df.dropna(): Remove rows with missing values.
4. df.rename(columns): Rename columns.
5. df.sort_values(by): Sort DataFrame by column(s).
6. df.groupby(column): Group data based on a column.
7. df.pivot_table(): Create a pivot table.

In [111]:
df.columns

Index(['school', 'sex', 'age', 'health', 'address', 'studytime', 'internet'], dtype='object')

In [112]:
#dropping a column
df = df.drop('address',axis=1)
df.columns

Index(['school', 'sex', 'age', 'health', 'studytime', 'internet'], dtype='object')

In [113]:
df.head(2)

  school sex  age  health  studytime internet
0     GP   M   18       5          2      yes
1     GP   M   18       1          1      yes

In [114]:
# dropping at index 0
df = df.drop(0)
df.head(2)

  school sex  age  health  studytime internet
1     GP   M   18       1          1      yes
2     GP   F   17       1          2      yes

In [115]:
df.reset_index(drop=True)

   school sex  age  health  studytime internet
0      GP   M   18       1          1      yes
1      GP   F   17       1          2      yes
2      GP   F   17       5          3      yes
3      GP   F   17       4          3      yes
4      GP   F   18       3          3      yes
..    ...  ..  ...     ...        ...      ...
94     GP   M   16       4          1      yes
95     GP   M   17       4          2      yes
96     GP   F   19       5          2      yes
97     GP   M   16       2          1      yes
98     GP   M   17       2          1      yes

[99 rows x 6 columns]